Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Deploy the Application to Kubernetes
ja_jp: アプリケーションをKubernetesにデプロイ

source: Deploy the Blue and Red services in Kubernetes
ja_jp: Kubernetes での Blue および Red サービスのデプロイ

source: Deploy the Docker image to Azure App Service for Linux Containers
ja_jp: DockerイメージをAzure App Service for Linux Containersにデプロイ

source: Deploy the Docker image to Azure Container Instances
ja_jp: DockerイメージをAzureコンテナーインスタンスにデプロイ

source: Deploy the Docker image to Azure Kubernetes Service
ja_jp: DockerイメージをAzure Kubernetes Serviceにデプロイ

source: Deploy the REST Client interface and the front end API in the Kubernetes cluster
ja_jp: Kubernetes クラスター へのREST Client インターフェイスおよびフロントエンド API のデプロイ

source: Deploy the application as Docker image to Heroku
ja_jp: アプリケーションをDockerイメージとしてHerokuにデプロイ

source: Deploy the application as container image to Heroku
ja_jp: アプリケーションのコンテナーイメージとしての Heroku へのデプロイ

source: Deploy the application to Heroku
ja_jp: アプリケーションの Heroku へのデプロイ

source: Deploy the native application as Docker image to Heroku
ja_jp: ネイティブアプリケーションをDockerイメージとしてHerokuにデプロイ

source: Deploy the native application as container image to Heroku
ja_jp: ネイティブアプリケーションのコンテナーイメージとしての Heroku へのデプロイ

source: Deploy the repository and build on Heroku
ja_jp: リポジトリのデプロイとHerokuでのビルド

source: Deploy the service:
ja_jp: サービスyamlをデプロイします。

source: Deploy to AWS
ja_jp: AWS にデプロイする

source: Deploy to AWS Lambda Custom (native) Runtime
ja_jp: AWS Lambda カスタム (ネイティブ) ランタイムへのデプロイ

source: Deploy to AWS Lambda Java Runtime
ja_jp: AWS Lambda の Java ランタイムにデプロイする

source: Deploy to AWS Lambda using a Container Image
ja_jp: コンテナイメージを使用して AWS Lambda にデプロイする

source: Deploy to Azure
ja_jp: Azureへのデプロイ

source: Deploy to Azure App Service on Linux Containers
ja_jp: Linuxコンテナー上のAzure App Serviceへのデプロイ

source: Deploy to Azure Container Instances
ja_jp: Azureコンテナーインスタンスへのデプロイ

source: Deploy to Azure Kubernetes Service
ja_jp: Azure Kubernetesサービスへのデプロイ

source: Deploy to Kubernetes/OpenShift
ja_jp: Kubernetes/OpenShiftへのデプロイ

source: Deploy your Quarkus applications on Heroku.
ja_jp: HerokuへのQuarkusアプリケーションのデプロイ

source: Deploy your application to use the certificate generated by OpenShift. This will make the service available over HTTPS.
ja_jp: OpenShift によって生成された証明書を使用するようにアプリケーションをデプロイします。 これにより、HTTPS 経由でサービスが利用できるようになります。

source: Deploying
ja_jp: デプロイ

source: Deploying Quarkus Applications on Kubernetes
ja_jp: Kubernetes上へのQuarkusアプリケーションのデプロイ

source: Deploying Quarkus Applications on OpenShift
ja_jp: OpenShift上へのQuarkusアプリケーションのデプロイ

source: Deploying Quarkus Java applications to OpenShift by using a Docker build strategy
ja_jp: Docker ビルドストラテジーを使用して Quarkus Java アプリケーションを OpenShift にデプロイする

source: Deploying Quarkus applications compiled to native executables
ja_jp: ネイティブ実行可能ファイルにコンパイルされた Quarkus アプリケーションのデプロイ

source: Deploying Quarkus applications to OpenShift
ja_jp: QuarkusアプリケーションのOpenShiftへのデプロイ

source: Deploying Quarkus applications to OpenShift in a single step
ja_jp: ワンステップでQuarkusアプリケーションをOpenShiftにデプロイ

source: Deploying a Docker image to Google App Engine Flexible Custom Runtimes
ja_jp: DockerイメージをGoogle App Engineフレキシブル環境カスタムランタイムへデプロイする

source: Deploying a Docker image to Google Cloud Run
ja_jp: Dockerイメージを Google Cloud Run にデプロイする

source: Deploying a JAR to Google App Engine Standard
ja_jp: JARをGoogle App Engineスタンダード環境にデプロイする

source: Deploying a container image lambda
ja_jp: コンテナイメージ Lambda のデプロイ

source: Deploying a function to Google Cloud Functions
ja_jp: Google Cloud Functions に Function をデプロイする

source: Deploying a native executable
ja_jp: ネイティブ実行可能ファイルのデプロイ

source: Deploying helm charts
ja_jp: Helm チャートのデプロイ

source: Deploying on OpenShift
ja_jp: OpenShiftへのデプロイ

source: Deploying the Greeting feature
ja_jp: Greeting 機能のデプロイ

source: Deploying to Google App Engine Flexible Custom Runtimes
ja_jp: Google App Engineフレキシブル環境カスタムランタイムへのデプロイ

source: Deploying to Google App Engine Standard
ja_jp: Google App Engineスタンダード環境へのデプロイ

source: Deploying to Google Cloud
ja_jp: Google Cloudへのデプロイ

source: Deploying to Google Cloud Functions
ja_jp: Google Cloud Functions へのデプロイ

source: Deploying to Google Cloud Platform (GCP)
ja_jp: Google Cloud Platform (GCP)へのデプロイ

source: Deploying to Google Cloud Run
ja_jp: Google Cloud Runへのデプロイ

source: Deploying to Heroku
ja_jp: Herokuへのデプロイ

source: Deploying to Kind
ja_jp: Kind へのデプロイメント

source: Deploying to Microsoft Azure Cloud
ja_jp: Microsoft Azure Cloudへのデプロイ

source: Deploying to Minikube
ja_jp: Minikube へのデプロイ

source: Deploying to OpenShift was also not working properly in 1.12.1.Final.
ja_jp: 1.12.1.Finalでは、OpenShiftへのデプロイも正常に動作していませんでした。

source: Deploying to local Kubernetes
ja_jp: ローカルKubernetesへのデプロイ

source: Deploying verticles
ja_jp: verticleの展開

source: Deploying your gRPC Service in Kubernetes
ja_jp: KubernetesでgRPCサービスをデプロイする

source: Deploying {project-name} applications to {openshift} with Java {jdk-version-latest}
ja_jp: Javaの {jdk-version-latest} で {project-name} アプリケーションを {openshift} にデプロイします。

source: Deploying {project-name} applications to {openshift} with Java {jdk-version-other}
ja_jp: Java {jdk-version-other} で {project-name} アプリケーションを {openshift} にデプロイします。

source: Deployment ClassLoader
ja_jp: デプロイメント ClassLoader

source: Deployment targets
ja_jp: デプロイメントターゲット

source: Deprecated configuration
ja_jp: 非推奨の設定

source: Deprecated for removal. If false will disable the default OTLP exporter at *build* time.
ja_jp: 削除のため非推奨となっています。 false の場合、*ビルド* 時にデフォルトの OTLP エクスポーターが無効になります。

source: Deprecation
ja_jp: 非推奨

source: Deprecation of `asEventStream`
ja_jp: `asEventStream` の非推奨

source: Deprecation of `asJsonArray`
ja_jp: `asJsonArray` の非推奨

source: Deprecation of `asJsonStream`
ja_jp: `asJsonStream` の非推奨

source: Depreciation
ja_jp: 非推奨

source: Derby (in-process)
ja_jp: Derby (インプロセス)

source: Derby cannot be embedded into the application in native mode. However, the Quarkus Derby extension allows native compilation of the Derby JDBC *client*, supporting *remote* connections.
ja_jp: Derbyをネイティブモードでアプリケーションに組み込むことはできません。 しかし、Quarkus Derbyエクステンションを使用すると、Derby JDBC *クライアント* をネイティブにコンパイルして、 *リモート* 接続をサポートできます。

source: Derby database connector
ja_jp: Derby データベースコネクター

source: Derby is an embedded database that can run as a server, based on a file, or can run completely in memory. All of these options are available as listed above.
ja_jp: Derbyは組み込みデータベースであり、サーバーとして実行することも、ファイルに基づいて実行することも、完全にメモリ内で実行することもできます。上記のオプションはすべて利用可能です。

source: Derby is an embedded database. It can run as a server, based on a file, or live completely in memory. All of these options are available as listed above. You can find more information at the https://db.apache.org/derby/docs/10.8/devguide/cdevdvlp17453.html#cdevdvlp17453[official documentation].
ja_jp: Derby は組み込みデータベースです。サーバーとして、ファイルを元にして、あるいは完全にメモリー内でライブで実行するこもできます。これらすべてのオプションは上記のように利用可能です。詳細は link:https://db.apache.org/derby/docs/10.8/devguide/cdevdvlp17453.html#cdevdvlp17453[公式ドキュメント] で確認できます。

source: Derived query methods
ja_jp: 派生クエリーメソッド

source: Describe a service:
ja_jp: サービスについて説明：

source: Describe the step briefly
ja_jp: 手順を簡単に説明します。

source: Describe the steps for completing the tutorial
ja_jp: チュートリアルを完了するための手順の説明

source: Description
ja_jp: 説明

source: Description of a Quarkus extension
ja_jp: Quarkus のエクステンションの説明

source: Description of each parameter.
ja_jp: 各パラメーターの説明。

source: Description of the method.
ja_jp: メソッドの説明。

source: Description that can be displayed to users. In this case, the description was copied from the `pom.xml` of the extension module but it could also be provided in the template file.
ja_jp: ユーザーに表示できる説明。この場合、説明はエクステンションモジュールの `pom.xml` からコピーされましたが、テンプレートファイルで提供することもできます。

source: Descriptive and avoid filler words
ja_jp: 説明的で、フィラーワードを避ける

source: Deserialization
ja_jp: デシリアライズ

source: Deserialization and Pulsar Schema
ja_jp: デシリアライゼーションと Pulsar Schema

source: Designates a particular representation (also called a media type), for example `text/plain` or `application/json`
ja_jp: text/plain や application/json などの特定の表現 (メディアタイプとも呼ばれます) を指定します

source: Designed for Fast Startup, High Throughput, and Low Resource Consumption
ja_jp: 高速起動、高スループット、低リソース消費を実現する設計

source: Designed for serving static resources via HTTP (e.g., JavaScript or CSS files).
ja_jp: HTTP 経由で静的リソース (JavaScript や CSS ファイルなど) を提供するために設計されています。

source: Despite WebSocket's compatibility with HTTP and its initiation through an HTTP request, it's crucial to recognize that the two protocols lead to distinctly different architectures and programming models.
ja_jp: WebSocket は HTTP と互換性があり、HTTP リクエストを通じて開始されますが、2 つのプロトコルは異なるアーキテクチャーとプログラミングモデルを導くため、その違いを認識することが重要です。

source: Despite its name, the CORS filter can also prevent CSRF attacks based on link:https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html#using-standard-headers-to-verify-origin[Origin verification]. Therefore, since the browser is expected to set an link:https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Origin[Origin header] for cross-origin JavaScript and HTML form requests, you might want to consider using the CORS filter instead of the link:{quarkusio-guides}/security-csrf-prevention[REST CSRF filter].
ja_jp: その名前にもかかわらず、CORS フィルターは link:https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html#using-standard-headers-to-verify-origin[オリジン検証] に基づく CSRF 攻撃も防止できます。 したがって、ブラウザーはクロスオリジン JavaScript および HTML フォームリクエストに対して link:https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Origin[Origin ヘッダー] を設定することが期待されるため、link:{quarkusio-guides}/security-csrf-prevention[REST CSRF フィルター] の代わりに CORS フィルターの使用を検討してもよいでしょう。

source: Despite the existence of the plugin, a few AMQP 1.0 features won’t work with RabbitMQ. Thus, we recommend the following configurations.
ja_jp: プラグインが存在するにもかかわらず、一部の AMQP 1.0 機能は RabbitMQ では機能しません。したがって、次の設定をお勧めします。

source: Detailed information on the usage of `@Blocking` annotation can be found in https://smallrye.io/smallrye-reactive-messaging/latest/concepts/blocking/[SmallRye Reactive Messaging – Handling blocking execution].
ja_jp: `@Blocking` アノテーションの使用法の詳細については、 https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/advanced/blocking.html[SmallRye Reactive Messaging – Handling blocking execution] を参照してください。

source: Detailed information on the usage of `@Blocking` annotation can be found in https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/advanced/blocking.html[SmallRye Reactive Messaging – Handling blocking execution].
ja_jp: `@Blocking` アノテーションの使用法の詳細については、 https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/advanced/blocking.html[SmallRye Reactive Messaging – Handling blocking execution] を参照してください。

source: Detailed per-request debugging information, potentially at a very high frequency.
ja_jp: リクエストごとの詳細なデバッグ情報。非常に高頻度で提供される可能性があります。

source: Detect pinned thread in tests
ja_jp: テストでピン留めされたスレッドを検出する

source: Detect vulnerabilities in Quarkus at build time
ja_jp: ビルド時にQuarkusの脆弱性を検出

source: Detected IP address
ja_jp: 検出された IP アドレス

source: Detecting When Blocking Is Allowed
ja_jp: ブロックが許可されているかどうかの検出

source: Determine which of these beans also has the `IConfigConsumer` interface.
ja_jp: これらの Bean のどれが `IConfigConsumer` インターフェイスも持っているかを判別します。

source: Determining the `@PlanningVariable` fields for an arbitrary constraint solving use case is often challenging the first time. Read https://docs.optaplanner.org/latestFinal/optaplanner-docs/html_single/index.html#domainModelingGuide[the domain modeling guidelines] to avoid common pitfalls.
ja_jp: 任意制約解決のユースケースの `@PlanningVariable` フィールドを初めて決定する場合、それは簡単ではありません。一般的な落とし穴を避けるために、 https://docs.optaplanner.org/latestFinal/optaplanner-docs/html_single/index.html#domainModelingGuide[ドメインのモデル化ガイドライン] をお読みください。

source: Dev Experience
ja_jp: 開発エクスペリエンス

source: Dev MCP (Enable your Dev Mode to expose a MCP Server)
ja_jp: Dev MCP (開発モードで MCP サーバーを公開できるようにする)

source: Dev Mode
ja_jp: Devモード

source: Dev Mode Differences
ja_jp: 開発モードの差異

source: Dev Service
ja_jp: Dev Services

source: Dev Service creation is handled by a builder (and there are different builders for connecting to an externally-managed instance and creating a new service)
ja_jp: Dev Service の作成はビルダーによって処理されます (外部管理インスタンスへの接続と新しいサービスの作成には、それぞれ異なるビルダーがあります)。

source: Dev Service implementations first try locating services via shared service labels (e.g., services started by other applications)
ja_jp: Dev Service の実装は、まず共有サービスラベルを介してサービス (例: 他のアプリケーションによって開始されたサービス) の特定を試みます。

source: Dev Services (Configuration Free Databases)
ja_jp: 開発サービス（コンフィグレーション・フリー・データベース）

source: Dev Services (Configuration Free Datastores)
ja_jp: 開発サービス (設定不要のデータストア)

source: Dev Services Overview
ja_jp: Dev Servicesの概要

source: Dev Services and Dev UI for OpenID Connect (OIDC)
ja_jp: OpenID Connect (OIDC)のDev ServicesとDev UI

source: Dev Services and UI Support for other OpenID Connect Providers
ja_jp: その他の OpenID Connect プロバイダーの Dev Services と UI サポート

source: Dev Services and UI for OpenID Connect (OIDC)
ja_jp: OpenID Connect (OIDC) の開発サービスおよび UI

source: Dev Services are designed to be frictionless, so they will be automatically started any time you include an extension which supports Dev Services, as long as you don't configure a connection to an external service.
ja_jp: Dev Servicesは摩擦のないように設計されているため、外部サービスへの接続を設定しない限り、Dev Servicesをサポートするエクステンションを組み込むといつでも自動的に開始されます。

source: Dev Services are generally relevant for extensions that "connect" to something, such as databases for datasources, a keycloak instance for security, an Apache Kafka instance for messaging, etc.
ja_jp: Dev Services は通常、データソースのデータベース、セキュリティーの Keycloak インスタンス、メッセージングの Apache Kafka インスタンスなど、何かに接続するエクステンションに関連しています。

source: Dev Services are prepped at build time, but the actual `start()` call happens post-build, pre-runtime
ja_jp: Dev Services はビルド時に準備されますが、実際の `start()` 呼び出しはビルド後、ランタイム前に行われます。

source: Dev Services beyond the Quarkus Platform
ja_jp: Quarkusプラットフォーム以外のDev Services

source: Dev Services datatabase, username and password are now unified across all supported databases and can be configured.
ja_jp: Dev Servicesのデータベース、ユーザー名、パスワードは、対応するすべてのデータベースで統一され、設定することができるようになりました。

source: Dev Services for AMQP automatically starts an AMQP 1.0 broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
ja_jp: Dev Services for AMQP は、開発モードやテストの実行時に AMQP 1.0 ブローカーを自動的に起動します。そのため、ブローカーを手動で起動する必要はありません。アプリケーションは自動的に構成されます。

source: Dev Services for AMQP is automatically enabled unless:
ja_jp: 以下の場合を除き、Dev Services for AMQPは自動的に有効になります。

source: Dev Services for AMQP relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker access using the `amqp-host`, `amqp-port`, `amqp-user` and `amqp-password` properties.
ja_jp: Dev Services for AMQPでは、ブローカーの起動にDockerを使用しています。お使いの環境でDockerがサポートされていない場合は、ブローカーを手動で起動するか、すでに稼働しているブローカーに接続する必要があります。ブローカーのアクセスは、 `amqp-host` 、 `amqp-port` 、 `amqp-user` 、 `amqp-password` プロパティを使用して構成できます。

source: Dev Services for AMQP starts the container with the `quarkus-dev-service-amqp` label which is used to identify the container.
ja_jp: Dev Services for AMQP は、コンテナを識別するために使用される `quarkus-dev-service-amqp` ラベルでコンテナを開始します。

source: Dev Services for AMQP supports xref:compose-dev-services.adoc[Compose Dev Services]. It relies on a `compose-devservices.yml`, such as:
ja_jp: Dev Services for AMQP は xref:compose-dev-services.adoc[Compose Dev Services ] をサポートしています。 これは `compose-devservices.yml` に依存しています：

source: Dev Services for AMQP uses https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker] images. You can configure the image and version using the `quarkus.amqp.devservices.image-name` property:
ja_jp: Dev Services for AMQPでは、 link:https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker]イメージを使用しています。 `quarkus.amqp.devservices.image-name` プロパティを使用して、イメージとバージョンを設定できます。

source: Dev Services for Apicurio Registry is automatically enabled unless:
ja_jp: Dev Services for Apicurio Registryは以下に当てはまらない場合、自動的に有効になります。

source: Dev Services for Apicurio Registry relies on Docker to start the registry. If your environment does not support Docker, you will need to start the registry manually, or use an already running registry. In such case, you can configure the registry URL for all Kafka channels in SmallRye Reactive Messaging with a single property. For Apicurio Registry serde, that is:
ja_jp: Dev Services for Apicurio Registryは、レジストリの起動にDockerを使用しています。お使いの環境がDockerをサポートしていない場合は、レジストリを手動で起動するか、すでに稼働しているレジストリを使用する必要があります。そのような場合、単一のプロパティを使用して、SmallRye Reactive Messaging のすべての Kafka チャネルのレジストリ URL を構成できます。 Apicurio Registry serde の場合は以下です。

source: Dev Services for Apicurio Registry relies on Docker to start the registry. If your environment does not support Docker, you will need to start the registry manually, or use an already running registry. You can configure the registry URL for all Kafka channels in SmallRye Reactive Messaging with a single property:
ja_jp: Dev Services for Apicurio Registryは、レジストリの起動にDockerを使用しています。お使いの環境がDockerをサポートしていない場合は、レジストリを手動で起動するか、すでに稼働しているレジストリを使用する必要があります。SmallRye Reactive MessagingのすべてのKafkaチャンネルのレジストリURLは、1つのプロパティで設定できます。

source: Dev Services for Apicurio Registry starts the container with the `quarkus-dev-service-apicurio-registry` label which is used to identify the container.
ja_jp: Dev Services for Apicurio Registryは、コンテナを識別するために使用される `quarkus-dev-service-apicurio-registry` ラベル付でコンテナを起動します。

source: Dev Services for Apicurio Registry starts the container with the `quarkus-dev-service-apicurio-registry` label, which is used to identify the container.
ja_jp: Dev Services for Apicurio Registry は、コンテナーを識別するために使用される `quarkus-dev-service-apicurio-registry` ラベルを付けてコンテナーを起動します。

source: Dev Services for Apicurio Registry uses `apicurio/apicurio-registry-mem` images. You can select any 2.x version from https://hub.docker.com/r/apicurio/apicurio-registry-mem:
ja_jp: Dev Services for Apicurio Registryは、 `apicurio/apicurio-registry-mem` のイメージを使用しています。 https://hub.docker.com/r/apicurio/apicurio-registry-mem から任意の 2.x バージョンを選択することができます。

source: Dev Services for Apicurio Registry uses `apicurio/apicurio-registry` images. These images use an in-memory h2 database by default. You can select any 3.x version from https://hub.docker.com/r/apicurio/apicurio-registry:
ja_jp: Dev Services for Apicurio Registry は `apicurio/apicurio-registry` イメージを使用します。これらのイメージは、デフォルトでインメモリーの H2 データベースを使用します。 https://hub.docker.com/r/apicurio/apicurio-registry から、任意の 3.x バージョンを選択できます。

source: Dev Services for Databases support the following configuration options:
ja_jp: Dev Services for Databases は、以下の設定オプションをサポートしています:

source: Dev Services for Elasticsearch is automatically enabled unless:
ja_jp: Dev Services for Elasticsearchは、以下の場合を除き、自動的に有効化されます。

source: Dev Services for Elasticsearch is currently unable to start multiple clusters concurrently, so it only works with the default backend of the default persistence unit: named persistence units or named backends won't be able to take advantage of Dev Services for Elasticsearch.
ja_jp: Dev Services for Elasticsearchは現時点では複数のクラスタを同時に起動することができず、デフォルトの永続化ユニットのデフォルトのバックエンドでのみ動作します:名前付き永続化ユニットや名前付きバックエンドはDev Services for Elasticsearchを利用することができません。

source: Dev Services for Elasticsearch only support Elasticsearch based images, OpenSearch is not supported at the moment.
ja_jp: Dev Services for Elasticsearchは、Elasticsearchベースのイメージのみをサポートし、Opensearchは現時点ではサポートされていません。

source: Dev Services for Elasticsearch relies on Docker to start the server. If your environment does not support Docker, you will need to start the server manually, or connect to an already running server.
ja_jp: Dev Services for Elasticsearchは、サーバーの起動にDockerを利用しています。Dockerに対応していない環境では、手動でサーバを起動するか、既に起動しているサーバに接続する必要があります。

source: Dev Services for Elasticsearch starts the container with the `quarkus-dev-service-elasticsearch` label which is used to identify the container.
ja_jp: Dev Services for Elasticsearch は、コンテナの識別に使用される `quarkus-dev-service-elasticsearch` ラベルでコンテナを起動します。

source: Dev Services for Elasticsearch support distributions based on both Elasticsearch and OpenSearch images.
ja_jp: Dev Services for Elasticsearchは、ElasticsearchとOpenSearchの両方のイメージに基づいたディストリビューションをサポートしています。

source: Dev Services for Infinispan is automatically enabled unless:
ja_jp: Infinispanの開発サービスは、以下の条件が満たされない限り自動的に有効になります:

source: Dev Services for Infinispan relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker address using `quarkus.infinispan-client.hosts`.
ja_jp: Infinispan 開発サービスはブローカーの起動に Docker を利用しています。 お使いの環境が Docker をサポートしていない場合、ブローカーを手動で起動するか、すでに起動しているブローカーに接続する必要があります。 ブローカーのアドレスは `quarkus.infinispan-client.server-list` を使用して設定できます。

source: Dev Services for Infinispan relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker address using `quarkus.infinispan-client.server-list`.
ja_jp: Dev Services for InfinispanはDockerに依存してブローカーを起動します。 お使いの環境が Docker をサポートしていない場合は、手動でブローカーを起動するか、すでに起動しているブローカーに接続する必要があります。 ブローカーのアドレスは `quarkus.infinispan-client.server-list` を使って設定できます。

source: Dev Services for Infinispan relies on Docker to start the server.
ja_jp: Dev Services for Infinispanは、サーバーの起動をDockerに依存しています。

source: Dev Services for Infinispan relies on Docker/Podman to start the server.
ja_jp: Dev Services for Infinispanはサーバーの起動にDocker/Podmanを利用しています。

source: Dev Services for Infinispan starts the container with the `infinispan` label which is used to identify the container.
ja_jp: Dev Services for Infinispanは、コンテナを識別するためのラベル（ `infinispan` ）を付けてコンテナを起動します。

source: Dev Services for Infinispan starts the container with the `quarkus-dev-service-infinispan` label which is used to identify the container.
ja_jp: Infinispanの開発サービス は、コンテナを識別するために使用される `quarkus-dev-service-infinispan` ラベルでコンテナを起動します。

source: Dev Services for Infinispan supports xref:compose-dev-services.adoc[Compose Dev Services]. It relies on a `compose-devservices.yml`, such as:
ja_jp: Dev Services for Infinispan は xref:compose-dev-services.adoc[Compose Dev Services] をサポートしています。 これは `compose-devservices.yml` に依存しています：

source: Dev Services for Infinispan will spin up an Infinispan with the infinispan.xml file by default. However, there are cases where is helpful to provide some extra configuration to the server. This can be done by adding configuration files in xml, yaml or json to the resources classpath and providing the following configuration:
ja_jp: Dev Services for Infinispanは、デフォルトでinfinispan.xmlファイルを使用してInfinispanをスピンアップします。 しかし、サーバーに追加の設定を提供すると便利な場合があります。 この場合、xml、yaml、またはjson形式の設定ファイルをリソースのクラスパスに追加し、以下の設定を行います：

source: Dev Services for Kafka is automatically enabled unless:
ja_jp: 以下の場合を除き、Dev Services for Kafkaが自動的に有効になります:

source: Dev Services for Kafka only support Redpanda.
ja_jp: Kafka向けDev ServicesはRedpandaのみ対応しています。
